ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/hal_lld_gd32vf103.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @defgroup STM32F10X_CL_HAL STM32F105/F107 HAL Support
 * @details HAL support for STM32 Connectivity Line sub-family.
 *
 * @ingroup HAL
 */

/**
 * @file    GD32VF103/hal_lld_f105_f107.h
 * @brief   STM32F10x Connectivity Line HAL subsystem low level driver header.
 *
 * @addtogroup STM32F10X_CL_HAL
 * @{
 */

#ifndef _HAL_LLD_F105_F107_H_
#define _HAL_LLD_F105_F107_H_

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Absolute Maximum Ratings
 * @{
 */
/**
 * @brief   Maximum system clock frequency.
 */
#if defined(GD32_ALLOW_120MHZ_SYSCLK)
#define GD32_SYSCLK_MAX        120000000
#else
#define GD32_SYSCLK_MAX        108000000
#endif

/**
 * @brief   Maximum HXTAL clock frequency.
 */
#define GD32_HXTALCLK_MAX        25000000

/**
 * @brief   Minimum HXTAL clock frequency.
 */
#define GD32_HXTALCLK_MIN         3000000

/**
 * @brief   Maximum LXTAL clock frequency.
 */
#define GD32_LXTALCLK_MAX        1000000

/**
 * @brief   Minimum LXTAL clock frequency.
 */
#define GD32_LXTALCLK_MIN        32768

/**
 * @brief   Maximum PLL input clock frequency.
 */
#define GD32_PLLIN_MAX        12000000

/**
 * @brief   Minimum PLL input clock frequency.
 */
#define GD32_PLLIN_MIN        3000000

/**
 * @brief   Maximum PLL1 input clock frequency.
 */
#define GD32_PLL12IN_MAX       5000000

/**
 * @brief   Minimum PLL1 and PLL2 input clock frequency.
 */
#define GD32_PLL12IN_MIN       3000000

/**
 * @brief   Maximum PLL output clock frequency.
 */
#if defined(GD32_ALLOW_120MHZ_SYSCLK)
#define GD32_PLLOUT_MAX        120000000
#else
#define GD32_PLLOUT_MAX        108000000
#endif

/**
 * @brief   Minimum PLL output clock frequency.
 */
#define GD32_PLLOUT_MIN        16000000

/**
 * @brief   Maximum PLL1 and PLL2 VCO clock frequency.
 */
#define GD32_PLL12VCO_MAX      148000000

/**
 * @brief   Minimum PLL1 and PLL2 VCO clock frequency.
 */
#define GD32_PLL12VCO_MIN      80000000

/**
 * @brief   Maximum APB1 clock frequency.
 */
#if defined(GD32_ALLOW_120MHZ_SYSCLK)
#define GD32_PCLK1_MAX         60000000
#else
#define GD32_PCLK1_MAX         54000000
#endif

/**
 * @brief   Maximum APB2 clock frequency.
 */
#if defined(GD32_ALLOW_120MHZ_SYSCLK)
#define GD32_PCLK2_MAX        120000000
#else
#define GD32_PCLK2_MAX        108000000
#endif

/**
 * @brief   Maximum ADC clock frequency.
 */
#define GD32_ADCCLK_MAX        14000000

/**
 * @brief   Maximum SPI/I2S clock frequency.
 */
#define GD32_SPII2S_MAX        18000000
/** @} */

/**
 * @name    RCU_CFG0 register bits definitions
 * @{
 */
#define GD32_SCS_IRC8M            (0 << 0)    /**< SYSCLK source is IRC8M.      */
#define GD32_SCS_HXTAL            (1 << 0)    /**< SYSCLK source is HXTAL.      */
#define GD32_SCS_PLL            (2 << 0)    /**< SYSCLK source is PLL.      */

#define GD32_AHBPSC_DIV1         (0 << 4)    /**< SYSCLK divided by 1.       */
#define GD32_AHBPSC_DIV2         (8 << 4)    /**< SYSCLK divided by 2.       */
#define GD32_AHBPSC_DIV4         (9 << 4)    /**< SYSCLK divided by 4.       */
#define GD32_AHBPSC_DIV8         (10 << 4)   /**< SYSCLK divided by 8.       */
#define GD32_AHBPSC_DIV16        (11 << 4)   /**< SYSCLK divided by 16.      */
#define GD32_AHBPSC_DIV64        (12 << 4)   /**< SYSCLK divided by 64.      */
#define GD32_AHBPSC_DIV128       (13 << 4)   /**< SYSCLK divided by 128.     */
#define GD32_AHBPSC_DIV256       (14 << 4)   /**< SYSCLK divided by 256.     */
#define GD32_AHBPSC_DIV512       (15 << 4)   /**< SYSCLK divided by 512.     */

#define GD32_APB1PSC_DIV1        (0 << 8)    /**< HCLK divided by 1.         */
#define GD32_APB1PSC_DIV2        (4 << 8)    /**< HCLK divided by 2.         */
#define GD32_APB1PSC_DIV4        (5 << 8)    /**< HCLK divided by 4.         */
#define GD32_APB1PSC_DIV8        (6 << 8)    /**< HCLK divided by 8.         */
#define GD32_APB1PSC_DIV16       (7 << 8)    /**< HCLK divided by 16.        */

#define GD32_APB2PSC_DIV1        (0 << 11)   /**< HCLK divided by 1.         */
#define GD32_APB2PSC_DIV2        (4 << 11)   /**< HCLK divided by 2.         */
#define GD32_APB2PSC_DIV4        (5 << 11)   /**< HCLK divided by 4.         */
#define GD32_APB2PSC_DIV8        (6 << 11)   /**< HCLK divided by 8.         */
#define GD32_APB2PSC_DIV16       (7 << 11)   /**< HCLK divided by 16.        */

#define GD32_ADCPSC_DIV2       (0 << 14)   /**< PPRE2 divided by 2.        */
#define GD32_ADCPSC_DIV4       (1 << 14)   /**< PPRE2 divided by 4.        */
#define GD32_ADCPSC_DIV6       (2 << 14)   /**< PPRE2 divided by 6.        */
#define GD32_ADCPSC_DIV8       (3 << 14)   /**< PPRE2 divided by 8.        */
#define GD32_ADCPSC_DIV12    ((1 << 28) | (1 << 14))  /**< PPRE2 divided by 12.        */
#define GD32_ADCPSC_DIV16    ((1 << 28) | (3 << 14))  /**< PPRE2 divided by 16.        */

#define GD32_PLLSEL_IRC8M        (0 << 16)   /**< PLL clock source is IRC8M.   */
#define GD32_PLLSEL_PREDV0    (1 << 16)   /**< PLL clock source is
                                                 PREDV0.                   */

#define GD32_USBFSPRE_DIV2     (1 << 22)     /**< PLLOUT divided by 2.       */
#define GD32_USBFSPRE_DIV3     (0 << 22)     /**< PLLOUT divided by 3.       */
#define GD32_USBFSPSC_DIV2P5     (2 << 22)   /**< PLLOUT divided by 2.5.     */
#define GD32_USBFSPSC_DIV2       (3 << 22)   /**< PLLOUT divided by 2.       */

