ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/hal_lld_gd32vf103.h
#define GD32_CKOUT0SEL_NOCLOCK    (0 << 24)   /**< No clock on MCO pin.       */
#define GD32_CKOUT0SEL_SYSCLK     (4 << 24)   /**< SYSCLK on MCO pin.         */
#define GD32_CKOUT0SEL_IRC8M        (5 << 24)   /**< IRC8M clock on MCO pin.      */
#define GD32_CKOUT0SEL_HXTAL        (6 << 24)   /**< HXTAL clock on MCO pin.      */
#define GD32_CKOUT0SEL_PLLDIV2    (7 << 24)   /**< PLL/2 clock on MCO pin.    */
#define GD32_CKOUT0SEL_PLL1       (8 << 24)   /**< PLL1 clock on MCO pin.     */
#define GD32_CKOUT0SEL_PLL2DIV2   (9 << 24)   /**< PLL2/2 clock on MCO pin.   */
#define GD32_CKOUT0SEL_XT1        (10 << 24)  /**< XT1 clock on MCO pin.      */
#define GD32_CKOUT0SEL_PLL2       (11 << 24)  /**< PLL2 clock on MCO pin.     */
/** @} */

/**
 * @name    RCU_BDCR register bits definitions
 * @{
 */
#define GD32_RTCSEL_MASK       (3 << 8)    /**< RTC clock source mask.     */
#define GD32_RTCSEL_NOCLOCK    (0 << 8)    /**< No clock.                  */
#define GD32_RTCSEL_LXTAL        (1 << 8)    /**< LXTAL used as RTC clock.     */
#define GD32_RTCSEL_IRC40K        (2 << 8)    /**< IRC40K used as RTC clock.     */
#define GD32_RTCSEL_HXTALDIV     (3 << 8)    /**< HXTAL divided by 128 used as
                                                 RTC clock.                 */
/** @} */

/**
 * @name    RCU_CFG02 register bits definitions
 * @{
 */
#define GD32_PREDV0SEL_HXTAL    (0 << 16)   /**< PREDV0 source is HXTAL.     */
#define GD32_PREDV0SEL_PLL1   (1 << 16)   /**< PREDV0 source is PLL1.    */
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Main clock source selection.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_SCS) || defined(__DOXYGEN__)
#define GD32_SCS                    GD32_SCS_PLL
#endif

/**
 * @brief   Clock source for the PLL.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PLLSEL) || defined(__DOXYGEN__)
#define GD32_PLLSEL                GD32_PLLSEL_PREDV0
#endif

/**
 * @brief   PREDV0 clock source.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PREDV0SEL) || defined(__DOXYGEN__)
#define GD32_PREDV0SEL            GD32_PREDV0SEL_HXTAL
#endif

/**
 * @brief   PREDV0 division factor.
 * @note    The allowed range is 1...16.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PREDV0_VALUE) || defined(__DOXYGEN__)
#define GD32_PREDV0_VALUE         2
#endif

/**
 * @brief   PLL multiplier value.
 * @note    The allowed range is 4...32.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PLLMF_VALUE) || defined(__DOXYGEN__)
#define GD32_PLLMF_VALUE          18
#endif

/**
 * @brief   PREDV1 division factor.
 * @note    The allowed range is 1...16.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PREDV1_VALUE) || defined(__DOXYGEN__)
#define GD32_PREDV1_VALUE         5
#endif

/**
 * @brief   PLL1 multiplier value.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_PLL1MF_VALUE) || defined(__DOXYGEN__)
#define GD32_PLL1MF_VALUE         8
#endif

/**
 * @brief   PLL2 multiplier value.
 * @note    The default value is calculated for a 50MHz clock from
 *          a 8MHz crystal.
 */
#if !defined(GD32_PLL2MF_VALUE) || defined(__DOXYGEN__)
#define GD32_PLL2MF_VALUE         10
#endif

/**
 * @brief   AHB prescaler value.
 * @note    The default value is calculated for a 72MHz system clock from
 *          a 8MHz crystal using both PLL and PLL2.
 */
#if !defined(GD32_AHBPSC) || defined(__DOXYGEN__)
#define GD32_AHBPSC                  GD32_AHBPSC_DIV1
#endif

/**
 * @brief   APB1 prescaler value.
 */
#if !defined(GD32_APB1PSC) || defined(__DOXYGEN__)
#define GD32_APB1PSC                 GD32_APB1PSC_DIV2
#endif

/**
 * @brief   APB2 prescaler value.
 */
#if !defined(GD32_APB2PSC) || defined(__DOXYGEN__)
#define GD32_APB2PSC                 GD32_APB2PSC_DIV1
#endif

/**
 * @brief   ADC prescaler value.
 */
#if !defined(GD32_ADCPSC) || defined(__DOXYGEN__)
#define GD32_ADCPSC                GD32_ADCPSC_DIV4
#endif

/**
 * @brief   USB clock setting.
 */
#if !defined(GD32_USBFS_CLOCK_REQUIRED) || defined(__DOXYGEN__)
#define GD32_USBFS_CLOCK_REQUIRED    TRUE
#endif

/**
 * @brief   USBFS prescaler initialization.
 */
#if !defined(GD32_USBFSPRE) || defined(__DOXYGEN__)
#define GD32_USBFSPRE              GD32_USBFSPRE_DIV1P5
#endif

/**
 * @brief   Dedicated I2S clock setting.
 */
#if !defined(GD32_I2S_CLOCK_REQUIRED) || defined(__DOXYGEN__)
#define GD32_I2S_CLOCK_REQUIRED    FALSE
#endif

/**
 * @brief   MCO pin setting.
 */
#if !defined(GD32_CKOUT0SEL) || defined(__DOXYGEN__)
#define GD32_CKOUT0SEL              GD32_CKOUT0SEL_NOCLOCK
#endif

/**
 * @brief   RTC clock source.
 */
#if !defined(GD32_RTCSEL) || defined(__DOXYGEN__)
#define GD32_RTCSEL                   GD32_RTCSEL_NOCLOCK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/*
 * Configuration-related checks.
 */
/*#if !defined(STM32F107_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F107_MCUCONF not defined"
#endif*/

